In [52]:
working_data={
    "name_first":["shiva","honey",'kannama',"subhash"],
    "name_last":["venkatesan","rajkumar","rajkumar","venkatesan"],
    "mail_ID":["shiva@hotmail.com","honey@hotmail.com","kannama@hotmail.com","bose@hotmail.com"]
}

In [53]:
import pandas as pd

In [54]:
df=pd.DataFrame(working_data)

In [55]:
df

  name_first   name_last              mail_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [56]:
df.sort_values(by=["name_first",'name_last'],ascending =True)

  name_first   name_last              mail_ID
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
0      shiva  venkatesan    shiva@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [57]:
df.sort_values(by=["name_first",'name_last'],ascending =[False,True])

  name_first   name_last              mail_ID
3    subhash  venkatesan     bose@hotmail.com
0      shiva  venkatesan    shiva@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
1      honey    rajkumar    honey@hotmail.com

In [58]:
df.sort_index()

  name_first   name_last              mail_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com

In [59]:
df['name_last'].sort_values

<bound method Series.sort_values of 0    venkatesan
1      rajkumar
2      rajkumar
3    venkatesan
Name: name_last, dtype: object>

In [71]:
df[['name_last']inplace=True].sort_values(),

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1287062260.py, line 1)

In [63]:


df

  name_first   name_last              mail_ID
0      shiva  venkatesan    shiva@hotmail.com
1      honey    rajkumar    honey@hotmail.com
2    kannama    rajkumar  kannama@hotmail.com
3    subhash  venkatesan     bose@hotmail.com